In [45]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [46]:
%sql sqlite:///shopingmall.db

In [47]:
%%sql
drop table Customer;
drop table Seller;
drop table Storage;
drop table Product;
drop table Ordered;

 * sqlite:///shopingmall.db
Done.
Done.
Done.
Done.
Done.

[]

In [48]:
%%sql
create table Customer(
    customer_id     char(5) not null,
    name            varchar(20),
    address         varchar(20),
    tel             char(11),
    email           varchar(30),
    personal_num    char(13) not null,
    zip_code        char(5),
    primary key(customer_id)
);

create table Seller(
    seller_id       char(5) not null,
    name            varchar(20),
    address         varchar(20),
    tel             char(11),
    primary key(seller_id)
);

create table Storage(
    storage_num     char(5) not null,
    address         varcher(20),
    tel             char(11),
    primary key(storage_num)
);

create table Product(
    prod_id         char(5) not null,
    name            varchar(20),
    brand           varchar(20),
    size            varchar(5),
    color           varchar(10),
    stock           numeric(7,0),
    price           numeric(6,0),
    storage_num     char(5) not null,
    seller_id       char(5) not null,
    primary key(prod_id),
    foreign key(storage_num) references Storage,
    foreign key(seller_id) references Seller
);

create table Ordered(
    order_num       char(5) not null,
    date            char(6),
    prod_id         char(5) not null,
    count           numeric(3,0) not null,
    price           numeric(6,0),
    payment_status  char(1),
    customer_id     char(5) not null,
    deliver_status  char(1),
    primary key(order_num),
    foreign key(customer_id) references Customer,
    foreign key(price) references Product
);

 * sqlite:///shopingmall.db
Done.
Done.
Done.
Done.
Done.

[]

In [49]:
%sql select * from sqlite_master

 * sqlite:///shopingmall.db
Done.

[('table', 'Customer', 'Customer', 2, 'CREATE TABLE Customer( customer_id     char(5) not null,\n    name            varchar(20),\n    address         varchar(20),\n    tel             char(11),\n    email           varchar(30),\n    personal_num    char(13) not null,\n    zip_code        char(5),\n    primary key(customer_id)\n)'),
 ('index', 'sqlite_autoindex_Customer_1', 'Customer', 4, None),
 ('table', 'Seller', 'Seller', 5, 'CREATE TABLE Seller(\n    seller_id       char(5) not null,\n    name            varchar(20),\n    address         varchar(20),\n    tel             char(11),\n    primary key(seller_id)\n)'),
 ('index', 'sqlite_autoindex_Seller_1', 'Seller', 6, None),
 ('table', 'Storage', 'Storage', 7, 'CREATE TABLE Storage(\n    storage_num     char(5) not null,\n    address         varcher(20),\n    tel             char(11),\n    primary key(storage_num)\n)'),
 ('index', 'sqlite_autoindex_Storage_1', 'Storage', 8, None),
 ('table', 'Product', 'Product', 9, 'CREATE TABLE Product(\n    prod_id         char(5) not null,\n    name            varchar(20),\n    brand           varchar(20),\n    size            ... (171 characters truncated) ...       char(5) not null,\n    primary key(prod_id),\n    foreign key(storage_num) references Storage,\n    foreign key(seller_id) references Seller\n)'),
 ('index', 'sqlite_autoindex_Product_1', 'Product', 10, None),
 ('table', 'Ordered', 'Ordered', 13, 'CREATE TABLE Ordered(\n    order_num       char(5) not null,\n    date            char(6),\n    prod_id         char(5) not null,\n    count          ... (135 characters truncated) ... eliver_status  char(1),\n    primary key(order_num),\n    foreign key(customer_id) references Customer,\n    foreign key(price) references Product\n)'),
 ('index', 'sqlite_autoindex_Ordered_1', 'Ordered', 14, None)]

In [50]:
%%sql
insert into Customer values('38293', 'Alice', 'New York', '01012345678', 'qwer@naver.com', '9909092017213', '61005');
insert into Customer values('93886', 'Brian', 'Washington', '01023456789', 'wert@google.com', '8808081010102', '13579');
insert into Customer values('48026', 'Chris', 'LA', '01034567890', 'erty@naver.com', '770707102345','61005');
insert into Customer values('73829', 'Diana', 'Boston', '01045678901', 'rtyu@google.com','000101201234','93725');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [51]:
%sql select * from customer;

 * sqlite:///shopingmall.db
Done.

[('38293', 'Alice', 'New York', '01012345678', 'qwer@naver.com', '9909092017213', '61005'),
 ('93886', 'Brian', 'Washington', '01023456789', 'wert@google.com', '8808081010102', '13579'),
 ('48026', 'Chris', 'LA', '01034567890', 'erty@naver.com', '770707102345', '61005'),
 ('73829', 'Diana', 'Boston', '01045678901', 'rtyu@google.com', '000101201234', '93725')]

In [52]:
%%sql
insert into Seller values('12345','Apeach Mart', 'San Francisco', '41512345678');
insert into Seller values('13579','Bare Bear Bros', 'Otawa', '61323456789');
insert into Seller values('24680','Choonsik Shop', 'Seoul', '0234567890');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [53]:
%sql select * from seller;

 * sqlite:///shopingmall.db
Done.

[('12345', 'Apeach Mart', 'San Francisco', '41512345678'),
 ('13579', 'Bare Bear Bros', 'Otawa', '61323456789'),
 ('24680', 'Choonsik Shop', 'Seoul', '0234567890')]

In [54]:
%%sql
insert into Storage values('11111','Seoul','0234567890');
insert into Storage values('22222','San Francisco','41512345678');
insert into Storage values('33333','Otawa','61323456789');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [55]:
%sql select * from storage;

 * sqlite:///shopingmall.db
Done.

[('11111', 'Seoul', '0234567890'),
 ('22222', 'San Francisco', '41512345678'),
 ('33333', 'Otawa', '61323456789')]

In [56]:
%%sql
insert into Product values('01010','Anonymous mask','Anonymous','L','White','10000','12000','22222','13579');
insert into Product values('02121','Buster','Ghost','XL','Black','1000','120000','33333','12345');
insert into Product values('10132','Canon Shooter','Fortress','3XL','Blue','3000','300000','11111','12345');
insert into Product values('23513','Dancing Cam',"Let's Dance",'S','White','100000','21000','22222','24680');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [57]:
%sql select * from product;

 * sqlite:///shopingmall.db
Done.

[('01010', 'Anonymous mask', 'Anonymous', 'L', 'White', 10000, 12000, '22222', '13579'),
 ('02121', 'Buster', 'Ghost', 'XL', 'Black', 1000, 120000, '33333', '12345'),
 ('10132', 'Canon Shooter', 'Fortress', '3XL', 'Blue', 3000, 300000, '11111', '12345'),
 ('23513', 'Dancing Cam', "Let's Dance", 'S', 'White', 100000, 21000, '22222', '24680')]

In [58]:
%%sql
insert into Ordered values('505012','210501', '02121', '1','120000','Y','93886','Y');
insert into Ordered values('505010','210425', '10132', '1','300000','N','93886','N');
insert into Ordered values('505014','210504', '01010', '5','12000','Y','48026','N');
insert into Ordered values('505017','210505', '23513', '2','21000','Y','73829','Y');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [59]:
%sql select * from ordered;

 * sqlite:///shopingmall.db
Done.

[('505012', '210501', '02121', 1, 120000, 'Y', '93886', 'Y'),
 ('505010', '210425', '10132', 1, 300000, 'N', '93886', 'N'),
 ('505014', '210504', '01010', 5, 12000, 'Y', '48026', 'N'),
 ('505017', '210505', '23513', 2, 21000, 'Y', '73829', 'Y')]

## Functional Requirements

In [60]:
%sql select * from Ordered where customer_id = '93886'

 * sqlite:///shopingmall.db
Done.

[('505012', '210501', '02121', 1, 120000, 'Y', '93886', 'Y'),
 ('505010', '210425', '10132', 1, 300000, 'N', '93886', 'N')]

In [21]:
%sql select count from Ordered where prod_id = '01010'

 * sqlite:///shopingmall.db
Done.

[(5,)]

In [62]:
%sql select prod_id, name, price from Product where price between 20000 and 150000

 * sqlite:///shopingmall.db
Done.

[('02121', 'Buster', 120000), ('23513', 'Dancing Cam', 21000)]

In [63]:
%sql select prod_id, name, brand from Product where brand = 'Ghost'

 * sqlite:///shopingmall.db
Done.

[('02121', 'Buster', 'Ghost')]

In [64]:
%sql select * from Ordered where payment_status = 'Y'

 * sqlite:///shopingmall.db
Done.

[('505012', '210501', '02121', 1, 120000, 'Y', '93886', 'Y'),
 ('505014', '210504', '01010', 5, 12000, 'Y', '48026', 'N'),
 ('505017', '210505', '23513', 2, 21000, 'Y', '73829', 'Y')]

In [65]:
%sql select count*price as tot_price from Ordered where order_num = '505014'

 * sqlite:///shopingmall.db
Done.

[(60000,)]